src/main/resources/user_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://demo.com/spring-boot-soap-example">
        <soapenv:Header/>
        <soapenv:Body>
            <us:getUserRequest>
                <us:name>Sam</us:name>
            </us:getUserRequest>
        </soapenv:Body>
</soapenv:Envelope>