src/main/resources/country_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://demo.com/spring-boot-soap-example">
        <soapenv:Header/>
        <soapenv:Body>
            <us:getCountryRequest>
                <us:name>India</us:name>
            </us:getCountryRequest>
        </soapenv:Body>
</soapenv:Envelope>